JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/**
  ******************************************************************************
  * @file           : audio_engine.c
  * @brief          : Audio playback engine and DSP filter chain implementation
  ******************************************************************************
  *
  * MIT License
  *
  * Copyright (c) 2024-2026 Jennifer A. Gunn (with technological assistance).
  *
  * Permission is hereby granted, free of charge, to any person obtaining a copy
  * of this software and associated documentation files (the "Software"), to deal
  * in the Software without restriction, including without limitation the rights
  * to use, copy, modify, merge, publish, distribute, sublicense, and/or sell
  * copies of the Software, and to permit persons to whom the Software is
  * furnished to do so, subject to the following conditions:
  *
  * The above copyright notice and this permission notice shall be included in all
  * copies or substantial portions of the Software.
  *
  * THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND, EXPRESS OR
  * IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF MERCHANTABILITY,
  * FITNESS FOR A PARTICULAR PURPOSE AND NONINFRINGEMENT. IN NO EVENT SHALL THE
  * AUTHORS OR COPYRIGHT HOLDERS BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER
  * LIABILITY, WHETHER IN AN ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM,
  * OUT OF OR IN CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
  * SOFTWARE.
  *
  * @attention
  *
  * Reusable audio playback engine with runtime-configurable DSP filters.
  * Supports 8-bit and 16-bit samples, mono/stereo playback, and various
  * audio processing effects (LPF, DC blocking, fade in/out, soft clipping).
  *
  ******************************************************************************
  */

#include "../main.h"
#include "audio_engine.h"
#include <gd32f30x.h>
#include <math.h>           // Some of our filter calculations need math functions
#include <stddef.h>         // For NULL definition
#include <stdint.h>         // We like things predictable in these here ports.
#include <string.h>         // Needed for memset
#include <stdbool.h>        // For true/false values in filter config, we like our C modern, clean and readable.

#define AUDIO_INT16_MAX             32767
#define AUDIO_INT16_MIN             (-32768)
#define Q16_SCALE                   65536U
#define Q16_SCALE_F                 65536.0f
#define SOFT_CLIP_THRESHOLD         28000
#define DITHER_SEED_DEFAULT         12345U
#define DEFAULT_VOLUME_INPUT        32U
#define NOISE_GATE_ATTENUATION_Q15  3277

#if AUDIO_ENGINE_INLINE_DMA_CALLBACK
#define DMA_CALLBACK_INLINE inline __attribute__((always_inline))
#else
#define DMA_CALLBACK_INLINE __attribute__((noinline))
#endif


/* Forward declarations for internal helper functions */

// Fade and volume helpers
static inline   void      UpdateFadeCounters          ( uint32_t samples_processed );
static          int16_t   ApplyFadeIn                 ( int16_t sample );
static          int16_t   ApplyFadeOut                ( int16_t sample );
static inline   int16_t   ApplyVolumeSetting          ( int16_t sample, uint16_t volume_setting );

// Noise reduction and gating
static          int16_t   ApplyNoiseGate              ( int16_t sample );

// Clipping
static          int16_t   ApplySoftClipping           ( int16_t sample );
static inline   int32_t   ComputeSoftClipCurve        ( int32_t excess, int32_t range );

// DC blocking filters
static inline   int16_t   ApplyDCFilterWithAlpha     (
                                                        volatile int16_t input,
                                                        volatile int32_t *prev_input,
                                                        volatile int32_t *prev_output,
                                                        uint32_t alpha_q16
                                                      );
static          int16_t   ApplyDCBlockingFilter       (
                                                        volatile int16_t input,
                                                        volatile int32_t *prev_input,
                                                        volatile int32_t *prev_output
                                                      );
static          int16_t   ApplySoftDCFilter16Bit      (
                                                        volatile int16_t input,
                                                        volatile int32_t *prev_input,
                                                        volatile int32_t *prev_output
                                                      );

// Filtering
static          int16_t   Apply8BitDithering          ( uint8_t sample8 );
static inline   uint16_t  GetLpf8BitAlpha             ( LPF_Level lpf_level );
static          int16_t   ApplyLowPassFilter16Bit     ( 
                                                        int16_t input,
                                                        volatile int32_t *x1,
                                                        volatile int32_t *x2,
                                                        volatile int32_t *y1,
                                                        volatile int32_t *y2
                                                      );
static          int16_t   ApplyLowPassFilter8Bit      (
                                                        int16_t sample,
                                                        volatile int32_t *y1
                                                      );
static inline   int16_t   ApplyPostFilters            ( int16_t sample, AudioChannelId channel_id );
static          int16_t   ApplyFilterChain16Bit       ( int16_t sample, AudioChannelId channel_id );
static          int16_t   ApplyFilterChain8Bit        ( int16_t sample, AudioChannelId channel_id );

// DMA stop helper
static inline   void      StopDmaAndResetPlaybackState( uint8_t reset_state );

/* Hardware interface function pointers (set by application) */
DAC_SwitchFunc  AudioEngine_DACSwitch   = NULL;
ReadVolumeFunc  AudioEngine_ReadVolume  = NULL;
I2S_InitFunc    AudioEngine_I2SInit     = NULL;

/* Weak callback function for playback end notification */
__attribute__((weak)) void AudioEngine_OnPlaybackEnd( void )
{
  /* Default implementation does nothing - override in application if needed */
}

/* Volume divisor (populated by hardware GPIO reading) */
volatile uint16_t vol_input;

