JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/* Volume response configuration */
volatile uint8_t  volume_response_nonlinear = 1;                    // Default: enabled
volatile float    volume_response_gamma     = 2.0f;                 // Default: quadratic (human perception)

/* Playback buffer */
int16_t pb_buffer[ PB_BUFF_SZ ] = {SAMPLE16_MIDPOINT};              // Initialize to silence (midpoint for unsigned samples)

/* Filter configuration (runtime-tunable) */
volatile FilterConfig_TypeDef filter_cfg = {
  .enable_16bit_biquad_lpf      = 1,
  .enable_soft_dc_filter_16bit  = 1,
  .enable_8bit_lpf              = 1,
  .enable_noise_gate            = 0,
  .enable_soft_clipping         = 1,
  .enable_air_effect            = 0,
  .lpf_makeup_gain_q16          = LPF_MAKEUP_GAIN_Q16,
  .lpf_makeup_gain_16bit_q16    = LPF_16BIT_MAKEUP_GAIN_Q16,
  .lpf_16bit_level              = LPF_Custom,
  .lpf_16bit_custom_alpha       = LPF_16BIT_SOFT,
  .lpf_8bit_level               = LPF_Medium,
  .lpf_8bit_custom_alpha        = LPF_MEDIUM,
  .enable_filter_chain_16bit    = 1,
  .enable_filter_chain_8bit     = 1
};

/* Playback state variables */
volatile  uint8_t         *pb_p8_ptr;                               // Pointer for 8-bit sample processing
volatile  uint8_t         *pb_end8_ptr;                             // End pointer for 8-bit sample processing
volatile  uint16_t        *pb_p16_ptr;                              // Pointer for 16-bit sample processing
volatile  uint16_t        *pb_end16_ptr;                            // End pointer for 16-bit sample processing

volatile  uint8_t         pb_state                    = PB_Idle;    // Playback state machine variable
volatile  uint8_t         half_to_fill;                             // Flag to indicate which half of the buffer to fill in the DMA callback
          uint8_t         pb_mode;                                  // Mono or stereo mode (set by application before playback)
          uint32_t        I2S_PlaybackSpeed           = 22025;      // Default playback speed in Hz

/* Playback engine control variables */
          uint32_t        p_advance;                                // Number of samples to advance in current buffer.
          PB_ModeTypeDef  channels                    = Mode_mono;  // Default to mono; set to Mode_stereo for stereo playback.
volatile  uint32_t        samples_remaining           = 0;          // Total samples remaining in current playback (used for tracking when to stop)
volatile  uint32_t        fadein_samples_remaining    = 0;          // Fade-in samples remaining, used for applying fade-in effect over specified duration
volatile  uint32_t        fadeout_samples_remaining   = 0;          // Fade-out samples remaining, used for applying fade-out effect over specified duration

/* Fade time configuration (stored in seconds, converted to samples based on playback speed) */
          float           fadein_time_seconds         = 0.150f;     // 150ms default
          float           fadeout_time_seconds        = 0.150f;     // 150ms default
          float           pause_fadeout_time_seconds  = 0.100f;     // 100ms default
          float           pause_fadein_time_seconds   = 0.100f;     // 100ms default
          uint32_t        fadein_samples              = 3300;       // Calculated fade in time from time and speed
          uint32_t        fadeout_samples             = 3300;       // Calculated fade out time from time and speed
          uint32_t        pause_fadeout_samples       = 2200;       // Calculated pause fade out time from time and speed
          uint32_t        pause_fadein_samples        = 2200;       // Calculated pause fade in time from time and speed

typedef struct AudioFilterChannelState {                            // Per-channel state for filters that require memory of previous samples
  volatile int32_t dc_prev_input;
  volatile int32_t dc_prev_output;
  volatile int32_t lpf8_x1;
  volatile int32_t lpf8_x2;
  volatile int32_t lpf8_y1;
  volatile int32_t lpf8_y2;
  volatile int32_t lpf16_x1;
  volatile int32_t lpf16_x2;
  volatile int32_t lpf16_y1;
  volatile int32_t lpf16_y2;
  volatile int32_t air_x1;
  volatile int32_t air_y1;
} AudioFilterChannelState;

static AudioFilterChannelState filter_state[ CHANNEL_COUNT ] = {0}; // Initialize all filter state to zero

/* Dither state */
volatile  uint32_t        dither_state                = DITHER_SEED_DEFAULT;
          uint16_t        lpf_8bit_alpha              = LPF_MEDIUM;

/* Biquad filter state for 16-bit samples */
volatile  uint16_t        lpf_16bit_alpha             = LPF_16BIT_SOFT;

#if AUDIO_ENGINE_ENABLE_AIR_EFFECT
/* Air Effect runtime shelf gain (Q16). Defaults to AIR_EFFECT_SHELF_GAIN */
volatile  int32_t         air_effect_shelf_gain_q16   = AIR_EFFECT_SHELF_GAIN;

/* Air Effect preset table (dB) */
static const float        air_effect_presets_db[]     = { 1.0f, 2.0f, 3.0f };
#define AIR_EFFECT_PRESET_COUNT ( (uint8_t)( sizeof(air_effect_presets_db) / sizeof(air_effect_presets_db[0]) ) )
static volatile uint8_t   air_effect_preset_idx       = 1;          // default +2 dB
#endif

/* Pause/resume state tracking */
volatile  const void      *paused_sample_ptr          = NULL;       // Pointer to sample position where pause was initiated, used for resuming from same position

/* Stop request flag for asynchronous stop with fade-out */
volatile  uint8_t         stop_requested              = 0;          // Set to 1 to request a stop with fade-out, used for asynchronous stop handling in main loop

/* Playback end callback invocation guard - ensures callback is called only once */
volatile  uint8_t         playback_end_callback_called = 0;         // Flag to ensure playback end callback is only called once per playback session, prevents multiple invocations in edge cases

/* DAC power control flag */
volatile  uint8_t         dac_power_control           = 1;          // Default to enabled


/* ===== Filter State Reset Helpers ===== */

/** Reset per-channel filter state to zero
  *
  * @param: state - Channel state to clear
  */
static inline void ResetFilterChannelState( AudioFilterChannelState *state )
{
  state->dc_prev_input = 0;
  state->dc_prev_output = 0;
  state->lpf8_x1 = 0;
  state->lpf8_x2 = 0;
  state->lpf8_y1 = 0;
  state->lpf8_y2 = 0;
  state->lpf16_x1 = 0;
  state->lpf16_x2 = 0;
  state->lpf16_y1 = 0;
  state->lpf16_y2 = 0;
  state->air_x1 = 0;
  state->air_y1 = 0;
}

/** Reset all per-channel filter state to zero
  *
  * @param: none
  */
static inline void ResetAllFilterState( void )
{
  ResetFilterChannelState( &filter_state[ CHANNEL_LEFT ] );
  ResetFilterChannelState( &filter_state[ CHANNEL_RIGHT ] );
}

/** Get pointer to channel filter state
  *
  * @param: channel_id - CHANNEL_LEFT or CHANNEL_RIGHT
  * @retval: AudioFilterChannelState* - Channel state pointer
  */
static inline AudioFilterChannelState *GetChannelState( AudioChannelId channel_id )
{
  return &filter_state[ channel_id ];
}

