JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/* ===== Audio Engine Initialization ===== */

/** Initialize the audio engine with hardware interface functions
  * 
  * @brief Initializes the audio engine and validates that all required hardware
  *        interface functions have been provided. Resets all filter state and
  *        playback variables to safe defaults.
  * 
  * @param: dac_switch - Function pointer for DAC on/off control
  * @param: read_volume - Function pointer for reading volume setting
  * @param: i2s_init - Function pointer for I2S initialization
  * @retval: PB_Playing if initialization successful, PB_Error if any pointer is NULL
  */
PB_StatusTypeDef AudioEngine_Init( DAC_SwitchFunc dac_switch,
                                   ReadVolumeFunc read_volume,
                                   I2S_InitFunc i2s_init )
{
  /* Validate that all required function pointers are provided */
  if( dac_switch == NULL || read_volume == NULL || i2s_init == NULL ) {
    return PB_Error;
  }
  
  /* Assign hardware interface functions */
  AudioEngine_DACSwitch   = dac_switch;
  AudioEngine_ReadVolume  = read_volume;
  AudioEngine_I2SInit     = i2s_init;
  
  /* Reset all filter state variables to clean state */
  ResetAllFilterState();
  
  /* Reset playback state variables */
  pb_state                                  = PB_Idle;
  pb_mode                                   = 0;
  fadeout_samples_remaining                 = 0;
  fadein_samples_remaining                  = 0;
  paused_sample_ptr                         = NULL;
  vol_input                                 = DEFAULT_VOLUME_INPUT;  // Safe default above noise floor
  
  /* Reset dither state to non-zero seed */
  dither_state = DITHER_SEED_DEFAULT;
  
  /* Initialize default filter configuration */
  filter_cfg.enable_16bit_biquad_lpf        = 1;
  filter_cfg.enable_soft_dc_filter_16bit    = 1;
  filter_cfg.enable_8bit_lpf                = 1;
  filter_cfg.enable_noise_gate              = 0;
  filter_cfg.enable_soft_clipping           = 1;
  filter_cfg.enable_air_effect              = 0;
  filter_cfg.lpf_makeup_gain_q16            = LPF_MAKEUP_GAIN_Q16;
  filter_cfg.lpf_makeup_gain_16bit_q16      = LPF_16BIT_MAKEUP_GAIN_Q16;
  filter_cfg.lpf_16bit_level                = LPF_Soft;
  filter_cfg.lpf_8bit_level                 = LPF_Medium;
  filter_cfg.lpf_8bit_custom_alpha          = LPF_MEDIUM;
  filter_cfg.enable_filter_chain_16bit      = 1;
  filter_cfg.enable_filter_chain_8bit       = 1;
  
  return PB_Idle;  // Success - ready to play but not currently playing
}


/* ===== Filter Configuration Functions ===== */

/** Setup filter configuration 
  * 
  * @brief Sets the filter configuration parameters.
  * @param: cfg - Pointer to FilterConfig_TypeDef structure with desired settings.
  * @retval: none
  */
void SetFilterConfig( const FilterConfig_TypeDef *cfg )
{
  if( cfg != NULL ) {
    filter_cfg = *cfg;
    // Ensure a sane makeup gain (default if zero, cap if too high)
    if( filter_cfg.lpf_makeup_gain_q16 == 0 ) {
      filter_cfg.lpf_makeup_gain_q16 = LPF_MAKEUP_GAIN_Q16;
    }
    else if( filter_cfg.lpf_makeup_gain_q16 > AIR_EFFECT_SHELF_GAIN_MAX ) {
      filter_cfg.lpf_makeup_gain_q16 = AIR_EFFECT_SHELF_GAIN_MAX;
    }
    if( filter_cfg.lpf_makeup_gain_16bit_q16 == 0 ) {
      filter_cfg.lpf_makeup_gain_16bit_q16 = LPF_16BIT_MAKEUP_GAIN_Q16;
    }
    else if( filter_cfg.lpf_makeup_gain_16bit_q16 > AIR_EFFECT_SHELF_GAIN_MAX ) {
      filter_cfg.lpf_makeup_gain_16bit_q16 = AIR_EFFECT_SHELF_GAIN_MAX;
    }
  }
}


/** Get current filter configuration 
  * 
  * @brief Retrieves the current filter configuration parameters.
  * @param: cfg - Pointer to FilterConfig_TypeDef structure to populate.
  * @retval: none
  */
void GetFilterConfig( FilterConfig_TypeDef *cfg )
{
  if( cfg != NULL ) {
    *cfg = filter_cfg;
  }
}


/** Set whether or not to use soft clipping
  *
  * @brief Enables or disables the soft clipping filter.
  * @param: enabled - Non-zero to enable, zero to disable.
  * @retval: none
  */
void SetSoftClippingEnable( uint8_t enabled )
{
  filter_cfg.enable_soft_clipping = enabled ? 1 : 0;
}


/** Get whether or not soft clipping is enabled
  *
  * @brief Retrieves the current state of the soft clipping filter.
  * @param: none
  * @retval: non-zero if enabled, zero if disabled.
  */
uint8_t GetSoftClippingEnable( void )
{
  return filter_cfg.enable_soft_clipping;
}


/** Set the aggressiveness level for the 8-bit low-pass filter.
  * 
  * @brief Sets the filter level for the 8-bit biquad low-pass filter.
  * @param: level - Filter level (LPF_VerySoft, LPF_Soft, LPF_Medium, LPF_Firm, LPF_Aggressive, LPF_Custom).
  * @retval: none
  */
void SetLpf8BitLevel( LPF_Level level )
{
  if( level == LPF_Off ) {
    filter_cfg.enable_8bit_lpf = 0;
  } else {
    filter_cfg.enable_8bit_lpf = 1;
    if( level > LPF_Custom ) { // Prevent invalid off state
      level = LPF_VerySoft;
    }
  }
  filter_cfg.lpf_8bit_level = level;
}


/* Get the 8-bit low-pass filter aggressiveness level 
 * @param: none
 * @retval: current filter level
 */
LPF_Level GetLpf8BitLevel(void)
{
  return filter_cfg.lpf_8bit_level;
}

void SetLpf8BitCustomAlpha( uint16_t alpha )
{
  filter_cfg.lpf_8bit_custom_alpha = alpha;
  filter_cfg.lpf_8bit_level = LPF_Custom;
  lpf_8bit_alpha = alpha;
}

uint16_t GetLpf8BitCustomAlpha( void )
{
  return filter_cfg.lpf_8bit_custom_alpha;
}

void SetFilterChain8BitEnable( uint8_t enabled )
{
  filter_cfg.enable_filter_chain_8bit = enabled ? 1 : 0;
}

uint8_t GetFilterChain8BitEnable( void )
{
  return filter_cfg.enable_filter_chain_8bit;
}

void SetFilterChain16BitEnable( uint8_t enabled )
{
  filter_cfg.enable_filter_chain_16bit = enabled ? 1 : 0;
}

uint8_t GetFilterChain16BitEnable( void )
{
  return filter_cfg.enable_filter_chain_16bit;
}

#if AUDIO_ENGINE_ENABLE_AIR_EFFECT
/** Sets whether to use the air effect or not
  * @param: enabled - Non-zero to enable, zero to disable.
  * @retval: none
  */
void SetAirEffectEnable( uint8_t enabled )
{
  filter_cfg.enable_air_effect = enabled ? 1 : 0;
}


/** Gets the state of the air effect enable flag
  * @param: none
  * @retval: non-zero if enabled, zero if disabled.
  */
uint8_t GetAirEffectEnable( void )
{
  return filter_cfg.enable_air_effect;
}


/** Air Effect runtime control: set shelf boost gain (Q16)
  * Clamps to AIR_EFFECT_SHELF_GAIN_MAX to avoid extreme boosts.
  * @param: gain_q16 - Desired shelf gain in Q16 format
  * @retval: none
  */
void SetAirEffectGainQ16( uint32_t gain_q16 )
{
  if( gain_q16 > AIR_EFFECT_SHELF_GAIN_MAX ) {
    gain_q16 = AIR_EFFECT_SHELF_GAIN_MAX;
  }
  air_effect_shelf_gain_q16 = (int32_t)gain_q16;
}


