JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
/** Air Effect runtime control: get current shelf boost gain (Q16)
  * @retval: current shelf gain in Q16
  */
uint32_t GetAirEffectGainQ16( void )
{
  return (uint32_t) air_effect_shelf_gain_q16;
}


/** Air Effect runtime control: set shelf boost using dB
  * Converts desired high-frequency boost (at ω=π) to internal G (Q16).
  * Formula: Hπ = 10^(db/20), G = (Hπ*(2-α) - α) / (2*(1-α))
  * @param: db - Desired boost in dB
  * @retval: none
  */
void SetAirEffectGainDb( float db )
{
  const float alpha               = (float)AIR_EFFECT_CUTOFF / Q16_SCALE_F;
  const float one_minus_alpha     = 1.0f - alpha;
  const float Hpi                 = powf( 10.0f, db / 20.0f );
  float G                         = (Hpi * ( 2.0f - alpha ) - alpha ) / ( 2.0f * one_minus_alpha );
  if( G < 0.0f ) G = 0.0f;
  uint32_t gain_q16               = (uint32_t)(G * Q16_SCALE_F + 0.5f);
  if( gain_q16 > AIR_EFFECT_SHELF_GAIN_MAX ) {
    gain_q16                      = AIR_EFFECT_SHELF_GAIN_MAX;
  }
  SetAirEffectGainQ16( gain_q16 );
}


/** Air Effect runtime control: get current shelf boost in dB (at ω=π)
  * Formula: Hπ = (α + 2(1-α)G) / (2-α), db = 20*log10(Hπ)
  * @retval: current boost in dB
  */
float GetAirEffectGainDb( void )
{
  const float alpha               = (float) AIR_EFFECT_CUTOFF / Q16_SCALE_F;
  const float one_minus_alpha     = 1.0f - alpha;
  const float G                   = (float) air_effect_shelf_gain_q16 / Q16_SCALE_F;
  const float Hpi                 = ( alpha + 2.0f * one_minus_alpha * G ) / ( 2.0f - alpha );
  return 20.0f * log10f( Hpi );
}


/** Air Effect preset selection by index
  * @param: preset_index - Index of desired preset (0 disables, >0 enables with that preset)
  * @retval: none
  */
void SetAirEffectPresetDb( uint8_t preset_index )
{
  if( preset_index >= AIR_EFFECT_PRESET_COUNT ) {
    preset_index = 0;
  }
  air_effect_preset_idx = preset_index;
  
  /* Auto-enable/disable air effect based on preset: 0 = off, >0 = on */
  SetAirEffectEnable( preset_index > 0 ? 1 : 0 );
  
  SetAirEffectGainDb( air_effect_presets_db[preset_index] );
}


/** Cycle to the next Air Effect preset. Returns the new preset index.
  * @retval: new preset index
  */
uint8_t CycleAirEffectPresetDb( void )
{
  uint8_t next = (uint8_t)( air_effect_preset_idx + 1 );
  if( next >= AIR_EFFECT_PRESET_COUNT ) {
    next = 0;
  }
  SetAirEffectPresetDb( next );
  return air_effect_preset_idx;
}


/** Get the current Air Effect preset index
  * @retval: current preset index
  */
uint8_t GetAirEffectPresetIndex( void )
{
  return air_effect_preset_idx;
}


/** Get the number of available Air Effect presets
 * @retval: preset count
  */
uint8_t GetAirEffectPresetCount( void )
{
  return AIR_EFFECT_PRESET_COUNT;
}

/** Get the dB value of a preset (clamps to current if OOB)
  * @param: preset_index - Index of desired preset
  * @retval: dB value of the preset
  */
float GetAirEffectPresetDb( uint8_t preset_index )
{
  if( preset_index  >=  AIR_EFFECT_PRESET_COUNT ) {
    preset_index    =   air_effect_preset_idx;
  }
  return air_effect_presets_db[preset_index];
}
#else   // If Air Effect is disabled at compile time, provide stubs that do nothing or return defaults.
void SetAirEffectEnable( uint8_t enabled )
{
  (void)enabled;
  filter_cfg.enable_air_effect = 0;
}

uint8_t GetAirEffectEnable( void )
{
  return 0;
}

void SetAirEffectGainQ16( uint32_t gain_q16 )
{
  (void)gain_q16;
}

uint32_t GetAirEffectGainQ16( void )
{
  return 0;
}

void SetAirEffectGainDb( float db )
{
  (void)db;
}

float GetAirEffectGainDb( void )
{
  return 0.0f;
}

void SetAirEffectPresetDb( uint8_t preset_index )
{
  (void)preset_index;
  filter_cfg.enable_air_effect = 0;
}

uint8_t CycleAirEffectPresetDb( void )
{
  return 0;
}

uint8_t GetAirEffectPresetIndex( void )
{
  return 0;
}

uint8_t GetAirEffectPresetCount( void )
{
  return 0;
}

float GetAirEffectPresetDb( uint8_t preset_index )
{
  (void)preset_index;
  return 0.0f;
}
#endif


/** Set LPF makeup gain 
  * 
  * @brief Sets the makeup gain applied after the low-pass filter.
  * @param: gain - Floating-point gain value (0.1 to 2.0).
  * @retval: none
  */
void SetLpfMakeupGain8Bit( float gain )
{
  if( gain < 0.1f ) {
    gain = 0.1f;
  } else if( gain > 2.0f ) {
    gain = 2.0f;
  }
  uint32_t q16 = (uint32_t)( gain * 65536.0f + 0.5f );
  filter_cfg.lpf_makeup_gain_q16 = q16;
}


/** Set 16-bit LPF makeup gain
  *
  * @brief Sets the makeup gain applied after the 16-bit low-pass filter. Default is 1.0 (No gain), lower limit: 0.1, upper limit: 2.0.
  * @param: gain - Floating-point gain value (0.1 to 2.0).
  * @retval: none
  */
void SetLpfMakeupGain16Bit( float gain )
{
  if( gain < 0.1f ) {
    gain = 0.1f;
  } else if( gain > 2.0f ) {
    gain = 2.0f;
  }
  uint32_t q16 = (uint32_t)( gain * 65536.0f + 0.5f );
  filter_cfg.lpf_makeup_gain_16bit_q16 = q16;
}


/** Get 16-bit LPF makeup gain
  *
  * @brief Returns the makeup gain applied after the 16-bit low-pass filter.
  * @retval: float - Linear gain value
  */
float GetLpfMakeupGain16Bit( void )
{
  return (float)filter_cfg.lpf_makeup_gain_16bit_q16 / 65536.0f;
}


/**
 * @brief Calculate Q16 alpha for 16-bit LPF from -3dB cutoff and sample rate
 *
 * 1-pole IIR: alpha = exp(-2*pi*fc/fs)
 * For biquad, this is a good starting point for the smoothing factor.
 *
 * @param cutoff_hz - Desired -3dB cutoff frequency in Hz
 * @param sample_rate_hz - Sample rate in Hz
 * @return Q16 alpha coefficient for SetLpf16BitCustomAlpha
 */
uint16_t CalcLpf16BitAlphaFromCutoff( float cutoff_hz, float sample_rate_hz )
{
  /* Validate input parameters */
  if( cutoff_hz <= 0.0f || sample_rate_hz <= 0.0f ) { return 0; }

  float alpha_f = expf( -2.0f * 3.14159265359f * cutoff_hz / sample_rate_hz );
  if( alpha_f < 0.0f ) alpha_f = 0.0f;
  if( alpha_f > 0.99998f ) alpha_f = 0.99998f; // avoid overflow
  return (uint16_t)( alpha_f * 65536.0f + 0.5f );
}

/**
 * @brief Calculate Q16 alpha for 8-bit LPF from -3dB cutoff and sample rate
 *
 * 1-pole IIR: alpha = 1 - exp(-2*pi*fc/fs)
 *
 * @param cutoff_hz - Desired -3dB cutoff frequency in Hz
 * @param sample_rate_hz - Sample rate in Hz
 * @return Q16 alpha coefficient for SetLpf8BitCustomAlpha
 */
uint16_t CalcLpf8BitAlphaFromCutoff( float cutoff_hz, float sample_rate_hz )
{
  /* Validate input parameters */
  if( cutoff_hz <= 0.0f || sample_rate_hz <= 0.0f ) { return 0; }

  float alpha_f = 1.0f - expf( -2.0f * 3.14159265359f * cutoff_hz / sample_rate_hz );
  if( alpha_f < 0.0f ) alpha_f = 0.0f;
  if( alpha_f > 0.99998f ) alpha_f = 0.99998f; // avoid overflow
  return (uint16_t)( alpha_f * 65536.0f + 0.5f );
}


/**
 * @brief Get Q16 alpha for 16-bit LPF custom mode from -3dB cutoff and current sample rate
 * @param cutoff_hz - Desired -3dB cutoff frequency in Hz
 * @return Q16 alpha coefficient
 */
uint16_t GetLpf16BitCustomAlphaFromCutoff( float cutoff_hz )
{
  return CalcLpf16BitAlphaFromCutoff( cutoff_hz, (float)I2S_PlaybackSpeed );
}


/**
 * @brief Calculate a sample offset from time, sample rate, and mode
 * @param seconds - Desired offset in seconds (>= 0)
 * @param sample_rate_hz - Sample rate in Hz
 * @param mode - Playback mode: Mode_mono or Mode_stereo
 * @return Sample offset in interleaved samples
 */
uint32_t CalcSampleOffsetSamples( float seconds, uint32_t sample_rate_hz, PB_ModeTypeDef mode )
{
  if( seconds <= 0.0f || sample_rate_hz == 0U ) {
    return 0U;
  }

  float samples_f = seconds * (float)sample_rate_hz;
  if( mode == Mode_stereo ) {
    samples_f *= 2.0f;
  }

  if( samples_f > (float)UINT32_MAX ) {
    return UINT32_MAX;
  }

