JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
    /* Determine which fade duration to use as reference. */
    uint32_t fade_total = ( pb_state == PB_Playing && fadein_samples_remaining <= fadein_samples ) ? 
                          fadein_samples : fadein_samples_remaining;
    
    int32_t progress    = fade_total - fadein_samples_remaining;

    // Use 64-bit intermediate to prevent overflow when squaring progress
    int64_t fade_mult   = ( (int64_t)progress * (int64_t)progress ) / fade_total;
    int64_t result      = ( (int64_t)sample * fade_mult ) / fade_total;

    // Clamp to valid 16-bit range
    if( result > AUDIO_INT16_MAX ) result = AUDIO_INT16_MAX;
    if( result < AUDIO_INT16_MIN ) result = AUDIO_INT16_MIN;

    return (int16_t)result;
  }
  return sample;
}


/** Apply fade-out effect to audio sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @retval: int16_t - Faded-out signed 16-bit audio sample
  */
static int16_t ApplyFadeOut( int16_t sample )
{
  uint8_t should_apply_fade = 0;
  uint32_t fade_total       = 0;
  uint32_t remaining_to_use = 0;
  
  if( pb_state == PB_Pausing && fadeout_samples_remaining > 0 ) {
    /* Apply fadeout during explicit pause */
    should_apply_fade = 1;
    fade_total        = pause_fadeout_samples;
    remaining_to_use  = fadeout_samples_remaining;
  } else if( pb_state == PB_Playing ) {
    /* For normal playback, check if we're in the fadeout window based on file position.
       Calculate remaining samples from current pointer position to end. */
    uint32_t remaining_in_file = 0;
    
    if( pb_mode == 16 ) {
      remaining_in_file = (uint32_t)( pb_end16_ptr - pb_p16_ptr );
    } else {
      remaining_in_file = (uint32_t)( pb_end8_ptr - pb_p8_ptr );
    }
    
    if( remaining_in_file > 0 && remaining_in_file <= fadeout_samples ) {
      should_apply_fade = 1;
      fade_total = fadeout_samples;
      remaining_to_use = remaining_in_file;
    }
  }
  
  if( should_apply_fade ) {
    // Use 64-bit intermediate to prevent overflow when squaring remaining
    int64_t fade_mult   = ( (int64_t)remaining_to_use * (int64_t)remaining_to_use ) / fade_total;
    int64_t result      = ( (int64_t)sample * fade_mult ) / fade_total;

    // Clamp to valid 16-bit range
    if( result > AUDIO_INT16_MAX ) result = AUDIO_INT16_MAX;
    if( result < AUDIO_INT16_MIN ) result = AUDIO_INT16_MIN;

    return (int16_t)result;
  }
  return sample;
}


/** Apply noise gate to audio sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @retval: int16_t - Noise-gated signed 16-bit audio sample
  */
static int16_t ApplyNoiseGate( int16_t sample )
{
  int16_t abs_sample = ( sample < 0 ) ? -sample : sample;
  if( abs_sample < NOISE_GATE_THRESHOLD ) {
    // Soft gate: attenuate signal using fixed-point integer math (Q15)
    // Example: 0.1 attenuation = 3277 (0.1 * 32768)
    const int16_t attenuation_q15 = NOISE_GATE_ATTENUATION_Q15; // ~0.1 in Q15
    return (int16_t)( ( sample * attenuation_q15 ) >> 15 );
  }
  return sample;
}


/** Update fade in/out counters
  * 
  * @param: samples_processed - Number of samples processed (1 for mono, 2 for stereo)
  */
static inline void UpdateFadeCounters( uint32_t samples_processed )
{
  /* Track how many samples remain in the file */
  if( samples_remaining > 0 ) {
    samples_remaining = ( samples_remaining > samples_processed ) ? 
                        samples_remaining - samples_processed : 0;
  }
  
  /* Fade in: ramp up from silence */
  if( fadein_samples_remaining > 0 ) {
    fadein_samples_remaining = ( fadein_samples_remaining > samples_processed ) ? 
                               fadein_samples_remaining - samples_processed : 0;
  }
  
  /* Fade out: applied during pause or at end of normal playback */
  if( fadeout_samples_remaining > 0 ) {
    fadeout_samples_remaining = ( fadeout_samples_remaining > samples_processed ) ? 
                                fadeout_samples_remaining - samples_processed : 0;
  }
}


/** Warm up 16-bit biquad filter state to avoid startup transient
  * 
  * @param: sample - Initial sample value to use for warmup iterations
  */
static inline void WarmupBiquadFilter16Bit( int16_t sample )
{
  AudioFilterChannelState *left  = &filter_state[ CHANNEL_LEFT ];
  AudioFilterChannelState *right = &filter_state[ CHANNEL_RIGHT ];
  // Run multiple passes to let aggressive filters settle smoothly
  for( uint8_t i = 0; i < BIQUAD_WARMUP_CYCLES; i++ ) {
    ApplyLowPassFilter16Bit( sample, &left->lpf16_x1, &left->lpf16_x2,
                             &left->lpf16_y1, &left->lpf16_y2 );
    ApplyLowPassFilter16Bit( sample, &right->lpf16_x1, &right->lpf16_x2,
                             &right->lpf16_y1, &right->lpf16_y2 );
  }
}


/** Compute soft clipping curve response
  * 
  * Helper function that calculates the smooth clipping curve.
  * Uses a cubic smoothstep function to gradually limit excess signal.
  * 
  * @param: excess - Amount by which signal exceeds threshold
  * @param: range - Dynamic range available beyond threshold (max - threshold)
  * @retval: int32_t - Curve scaling factor (typically 0 to 65536)
  */
static inline int32_t ComputeSoftClipCurve( int32_t excess, int32_t range )
{
  int32_t x = excess * (int32_t)Q16_SCALE / range;
  if( x > (int32_t)Q16_SCALE ) x = (int32_t)Q16_SCALE;
  int32_t x2 = ( x * x )  >> 16;
  int32_t x3 = ( x2 * x ) >> 16;

  return ( ( 3 * x2 ) >> 1 ) - ( ( 2 * x3 ) >> 1 );
}


/** Apply soft clipping to audio sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @retval: int16_t - Soft-clipped signed 16-bit audio sample
  */
static int16_t ApplySoftClipping( int16_t sample )
{
  const int32_t threshold = SOFT_CLIP_THRESHOLD;
  const int32_t max_val   = AUDIO_INT16_MAX;
  
  int32_t s = sample;
  
  if( s > threshold ) {
    int32_t excess   = s - threshold;
    int32_t range    = max_val - threshold;
    int32_t curve    = ComputeSoftClipCurve( excess, range );
    s                = threshold + ( ( range * curve ) >> 16 );
  }
  else if( s < -threshold ) {
    int32_t excess   = -threshold - s;
    int32_t range    = max_val - threshold;
    int32_t curve    = ComputeSoftClipCurve( excess, range );
    s                = -threshold - ( ( range * curve ) >> 16 );
  }
  
