JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
  if( s > max_val )  s = max_val;
  if( s < -max_val ) s = -max_val;
  
  return (int16_t) s;
}


/** Apply a DC filter with a configurable alpha coefficient
  *
  * @param: input - Signed 16-bit audio sample
  * @param: prev_input - Pointer to previous input sample
  * @param: prev_output - Pointer to previous output sample
  * @param: alpha_q16 - Q16 alpha coefficient
  * @retval: int16_t - Filtered signed 16-bit audio sample
  */
static inline int16_t ApplyDCFilterWithAlpha(
                                              volatile int16_t input,
                                              volatile int32_t *prev_input,
                                              volatile int32_t *prev_output,
                                              uint32_t alpha_q16
                                            )
{
  int32_t output = input - *prev_input +
                   ( ( *prev_output * (int32_t)alpha_q16 ) >> DC_FILTER_SHIFT );
  
  *prev_input   = input;
  *prev_output  = output;
  
  if ( output > AUDIO_INT16_MAX ) output = AUDIO_INT16_MAX;
  if ( output < AUDIO_INT16_MIN ) output = AUDIO_INT16_MIN;
  
  return (int16_t)output;
}


/** Apply DC blocking filter to audio sample
  * 
  * @param: input - Signed 16-bit audio sample
  * @param: prev_input - Pointer to previous input sample
  * @param: prev_output - Pointer to previous output sample
  * @retval: int16_t - DC-blocked signed 16-bit audio sample
  */
static int16_t ApplyDCBlockingFilter(
                                      volatile int16_t input,
                                      volatile int32_t *prev_input,
                                      volatile int32_t *prev_output
                                    )
{
  return ApplyDCFilterWithAlpha( input, prev_input, prev_output, DC_FILTER_ALPHA );
}


/** Apply soft DC filter to audio sample
  * 
  * @param: input - Signed 16-bit audio sample
  * @param: prev_input - Pointer to previous input sample
  * @param: prev_output - Pointer to previous output sample
  * @retval: int16_t - Soft DC-filtered signed 16-bit audio sample
  */
static int16_t ApplySoftDCFilter16Bit (
                                        volatile int16_t input,
                                        volatile int32_t *prev_input,
                                        volatile int32_t *prev_output
                                      )
{
  return ApplyDCFilterWithAlpha( input, prev_input, prev_output, SOFT_DC_FILTER_ALPHA );
}


/** Apply low-pass biquad filter to 16-bit sample
  * 
  * @param: input - Signed 16-bit audio sample
  * @param: x1, x2 - Pointers to previous input samples
  * @param: y1, y2 - Pointers to previous output samples
  * @retval: int16_t - Filtered signed 16-bit audio sample
  */
static int16_t ApplyLowPassFilter16Bit(
                                        int16_t input,
                                        volatile int32_t *x1,
                                        volatile int32_t *x2,
                                        volatile int32_t *y1,
                                        volatile int32_t *y2
                                      )
{
  uint32_t alpha = lpf_16bit_alpha;
  int32_t b0 = ( ( Q16_SCALE - alpha ) * ( Q16_SCALE - alpha ) ) >> 17;
  int32_t b1 = b0 << 1;
  int32_t b2 = b0;
  int32_t a1 = -( alpha << 1 );
  int32_t a2 = ( alpha * alpha ) >> 16;
  /* Use 64-bit accumulation to avoid overflow on aggressive coefficients */
  int64_t acc = ( (int64_t)b0 * input ) +
                ( (int64_t)b1 * (*x1) ) +
                ( (int64_t)b2 * (*x2) ) -
                ( (int64_t)a1 * (*y1) ) -
                ( (int64_t)a2 * (*y2) );
  int32_t output = (int32_t)( acc >> 16 );
  *x2 = *x1;
  *x1 = input;
  *y2 = *y1;
  *y1 = output;
  // Apply 16-bit LPF makeup gain
  int64_t output64 = ( (int64_t)output * (int64_t)filter_cfg.lpf_makeup_gain_16bit_q16 ) >> 16;
  if ( output64 > AUDIO_INT16_MAX ) output64 = AUDIO_INT16_MAX;
  if ( output64 < AUDIO_INT16_MIN ) output64 = AUDIO_INT16_MIN;
  output = (int32_t)output64;
  if ( output > AUDIO_INT16_MAX ) output = AUDIO_INT16_MAX;
  if ( output < AUDIO_INT16_MIN ) output = AUDIO_INT16_MIN;
  return (int16_t)output;
}


/** Apply Air Effect (High-Shelf Brightening) to 16-bit sample
  * 
  * One-pole high-shelf filter to add brightness/presence to audio.
  * Boosts frequencies above cutoff (~5-6 kHz @ 22 kHz sample rate).
  * 
  * @param: input - Signed 16-bit audio sample
  * @param: x1 - Pointer to previous input sample
  * @param: y1 - Pointer to previous output sample
  * @retval: int16_t - Filtered signed 16-bit audio sample
  */
#if AUDIO_ENGINE_ENABLE_AIR_EFFECT
static int16_t ApplyAirEffect( int16_t input, volatile int32_t *x1, volatile int32_t *y1 )
{
  // Air effect uses high-shelf filter to brighten treble
  int32_t alpha               = AIR_EFFECT_CUTOFF;              // ~0.75
  int32_t one_minus_alpha     = (int32_t)( Q16_SCALE - alpha ); // ~0.25
  int32_t shelf_gain          = air_effect_shelf_gain_q16;      // runtime-adjustable boost
  
  // High-pass portion: amplify high frequencies
  // Use 64-bit intermediates to prevent overflow when multiplying Q16 terms
  int32_t high_freq           = (int32_t)input - *x1;
  int64_t air_boost64         = ( ( (int64_t)high_freq * (int64_t)one_minus_alpha ) >> 16 );
  air_boost64                 = ( ( air_boost64 * (int64_t)shelf_gain ) >> 16 );
  int32_t air_boost           = (int32_t)air_boost64;
  
  // Output = low-pass + high-pass boost
  int64_t out64   = ( ( (int64_t)alpha * (int64_t)input ) >> 16 ) +
                  ( ( ( (int64_t)(65536 - alpha) * (int64_t)( *y1 ) ) >> 16 ) ) +
                  (int64_t)air_boost;
  int32_t output  = (int32_t)out64;
  
  *x1 = input;
  *y1 = output;
  
  if ( output > AUDIO_INT16_MAX ) output = AUDIO_INT16_MAX;
  if ( output < AUDIO_INT16_MIN ) output = AUDIO_INT16_MIN;
  
  return (int16_t)output;
}
#endif


/** Apply full filter chain to 16-bit sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @param: channel_id - CHANNEL_LEFT or CHANNEL_RIGHT
  * @retval: int16_t - Processed signed 16-bit audio sample
  */
static int16_t ApplyFilterChain16Bit( int16_t sample, AudioChannelId channel_id )
{
  AudioFilterChannelState *channel = GetChannelState( channel_id );
  if( filter_cfg.enable_16bit_biquad_lpf ) {
    sample = ApplyLowPassFilter16Bit( sample, &channel->lpf16_x1, &channel->lpf16_x2,
                                      &channel->lpf16_y1, &channel->lpf16_y2 );
  }
  
