JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
  return ApplyPostFilters( sample, channel_id );
}


/** Apply full filter chain to 8-bit sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @param: channel_id - CHANNEL_LEFT or CHANNEL_RIGHT
  * @retval: int16_t - Processed signed 16-bit audio sample
  */
static int16_t ApplyFilterChain8Bit( int16_t sample, AudioChannelId channel_id )
{
  AudioFilterChannelState *channel = GetChannelState( channel_id );
  if( filter_cfg.enable_8bit_lpf ) {
    sample = ApplyLowPassFilter8Bit( sample, &channel->lpf8_y1 );
  }
  
  return ApplyPostFilters( sample, channel_id );
}


/** Apply post-LPF filters common to 8-bit and 16-bit chains
  *
  * @param: sample - Signed 16-bit audio sample
  * @param: channel_id - CHANNEL_LEFT or CHANNEL_RIGHT
  * @retval: int16_t - Processed signed 16-bit audio sample
  */
static inline int16_t ApplyPostFilters( int16_t sample, AudioChannelId channel_id )
{
  AudioFilterChannelState *channel = GetChannelState( channel_id );
  volatile int32_t *dc_prev_input  = &channel->dc_prev_input;
  volatile int32_t *dc_prev_output = &channel->dc_prev_output;
  if( filter_cfg.enable_soft_dc_filter_16bit ) {
    sample = ApplySoftDCFilter16Bit( sample, dc_prev_input, dc_prev_output );
  } else {
    sample = ApplyDCBlockingFilter( sample, dc_prev_input, dc_prev_output );
  }
  
#if AUDIO_ENGINE_ENABLE_AIR_EFFECT
  if( filter_cfg.enable_air_effect ) {
    sample = ApplyAirEffect( sample, &channel->air_x1, &channel->air_y1 );
  }
#endif
  
  sample = ApplyFadeIn( sample );
  sample = ApplyFadeOut( sample );
  
  if( filter_cfg.enable_noise_gate ) {
    sample = ApplyNoiseGate( sample );
  }
  
  if( filter_cfg.enable_soft_clipping ) {
    sample = ApplySoftClipping( sample );
  }
  
  return sample;
}


/** Reset playback state variables to idle condition.
  * 
  * Resets mode, pointers, and counters.
  */
static void ResetPlaybackState( void ) {
  pb_mode                       = 0;
  paused_sample_ptr             = NULL;
  samples_remaining             = 0;
  fadeout_samples_remaining     = 0;
  fadein_samples_remaining      = 0;
  stop_requested                = 0;
  playback_end_callback_called  = 0;
}


/* ===== State Accessors ===== */

/** Get current playback state
  * 
  * @param: none
  * @retval: uint8_t - Current playback state (PB_Idle, PB_Playing, PB_Paused)
  */
uint8_t GetPlaybackState( void )
{
  return pb_state;
}


/** Set current playback state
  * 
  * @param: state - Desired playback state (PB_Idle, PB_Playing, PB_Paused)
  * @retval: none
  */
void SetPlaybackState( uint8_t state )
{
  pb_state = state;
}


/** DAC Control Setter
 *
 * @param: enable - 1 to enable DAC output, 0 to disable
 * @retval: none
 */
 void SetDAC_Control( uint8_t state )
 {
  dac_power_control = state;
 }


/** DAC Control Getter *
 * @param: none
 * @retval: uint8_t - Current DAC control state (1 for enabled, 0 for disabled)
 */
 uint8_t GetDAC_Control( void )
 {
  return dac_power_control;
 }
 

/** Get which half of the buffer to fill
  * 
  * @param: none
  * @retval: uint8_t - FIRST or SECOND half indicator
  */
uint8_t GetHalfToFill( void )
{
  return half_to_fill;
}


/** Set which half of the buffer to fill
  * 
  * @param: half - FIRST or SECOND half indicator
  * @retval: none
  */
void SetHalfToFill( uint8_t half )
{
  half_to_fill = half;
}


/** Set current playback speed
  * 
  * @brief Sets the playback speed for sample processing.  Not to be use mid-playback.
  * @param: speed - Desired playback speed in Hz
  * @retval: none
  */
void SetPlaybackSpeed( uint32_t speed )
{
  I2S_PlaybackSpeed = speed;
}


/* ============================================================================
 * DMA Callbacks
 * ============================================================================
 */

/* Static inline helpers */

/** Helper to recalculate fade sample counts based on current fade times
  *
  * Should be called whenever fade times or playback speed are changed to ensure fade
  * durations remain consistent.
  */
static inline void RecalculateFadeSamples( void )
{
  fadein_samples        = FadeTimeToSamples( fadein_time_seconds );
  fadeout_samples       = FadeTimeToSamples( fadeout_time_seconds );
  pause_fadeout_samples = FadeTimeToSamples( pause_fadeout_time_seconds );
  pause_fadein_samples  = FadeTimeToSamples( pause_fadein_time_seconds );
}


/** Clean up after playback ends
  *
  * Common cleanup logic for when playback finishes naturally or when a stop request is processed.
  * Resets state, fills buffer with silence, halts DMA, and calls the playback
  * end callback if it hasn't been called already.
  */
static inline void EndPlaybackCleanup( void )
{
  pb_state = PB_Idle;
  MIDPOINT_FILL_BUFFER();
  StopDmaAndResetPlaybackState( stop_requested );
  if( !playback_end_callback_called ) {
    playback_end_callback_called = 1;
    AudioEngine_OnPlaybackEnd();
  }
}


/** Stop DMA transmission and optionally reset playback state
  *
  * @param: reset_state - Non-zero to reset playback state
  * @retval: none
  */
static inline void StopDmaAndResetPlaybackState( uint8_t reset_state )
{
  dma_interrupt_disable( DMA0, DMA_CH4, DMA_INT_HTF | DMA_INT_FTF );
  i2s_disable( PROJECT_SPI );
  if( reset_state ) {
    ResetPlaybackState();
  }
}


/** Immediate stop of playback, halting DMA and resetting state without waiting for buffer to drain 
  *
  * Use when stopping from paused state or when an immediate halt is required.  Will not apply fade-out.
  */
static inline void StopImmediate( void )
{
  pb_state = PB_Idle;
  StopDmaAndResetPlaybackState( 1U );
  MIDPOINT_FILL_BUFFER();
  if( !playback_end_callback_called ) {
    playback_end_callback_called = 1;
    AudioEngine_OnPlaybackEnd();
  }
}


/** Common DMA callback processing logic
  *
  * Helper function to handle buffer refilling for both half-complete and 
  * complete DMA callbacks. Eliminates duplication between the two callbacks.
  *
  * @param: which_half - Which half of buffer to fill (FIRST or SECOND)
  * @retval: none
  */
static DMA_CALLBACK_INLINE void ProcessDMACallback( uint8_t which_half )
{
  if( which_half == FIRST ) {
    dma_interrupt_flag_clear( DMA0, DMA_CH4, DMA_INT_FLAG_HTF );
  } else {
      dma_interrupt_flag_clear( DMA0, DMA_CH4, DMA_INT_FLAG_FTF );
  }
  
  /* Handle pending stop request at the beginning of DMA callback (safest place to modify state) */
  if( stop_requested && pb_state != PB_Idle ) {
    /* Only handle stop if we're in a playable state */
    if( pb_state == PB_Paused ) {
      /* If paused, stop immediately */
      StopImmediate();
      return;
    }
    
