JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
    /* For playing states, initiate fade-out by shortening the sample duration */
    if( pb_state != PB_Pausing ) {
      /* If not already pausing, set state to pausing and prepare for fade */
      pb_state = PB_Pausing;
      if( pb_mode == 16 ) {
        uint32_t remaining = (uint32_t)( pb_end16_ptr - pb_p16_ptr );
        if( remaining > fadeout_samples ) {
          pb_end16_ptr = pb_p16_ptr + fadeout_samples;
        }
      } else if( pb_mode == 8 ) {
        uint32_t remaining = (uint32_t)( pb_end8_ptr - pb_p8_ptr );
        if( remaining > fadeout_samples ) {
          pb_end8_ptr = pb_p8_ptr + fadeout_samples;
        }
      }
    }
  }
  
  /* If fully paused (fadeout already complete), fill buffer with silence */
  if( pb_state == PB_Paused ) {
    //int16_t *output = ( which_half == SECOND ) ? (pb_buffer + CHUNK_SZ ) : pb_buffer;
    MIDPOINT_FILL_BUFFER();
    return;
  }
  
  /* Special case: if pausing and fadeout nearly complete, skip processing and fill with silence */
  if( pb_state == PB_Pausing && fadeout_samples_remaining <= HALFCHUNK_SZ ) {
    //int16_t *output = ( which_half == SECOND ) ? (pb_buffer + CHUNK_SZ ) : pb_buffer;
    MIDPOINT_FILL_BUFFER();
    pb_state = PB_Paused;
    return;
  }

  half_to_fill = which_half;

  if( pb_mode == 16 || pb_mode == 8 ) {
    if( ( pb_mode == 16 && pb_p16_ptr >= pb_end16_ptr ) ||
        ( pb_mode == 8  && pb_p8_ptr  >= pb_end8_ptr )
      ) {
      EndPlaybackCleanup();   // Cleanup and stop playback if we've reached the end of the sample data.
      return;
    }
    /* Only one chunk process will be used because of short-circuit evaluation. */
    if( ( pb_mode == 16 && ProcessNextWaveChunk( (int16_t *) pb_p16_ptr ) != PB_Playing ) ||
        ( pb_mode == 8  && ProcessNextWaveChunk_8_bit( (uint8_t *) pb_p8_ptr ) != PB_Playing ) ) {
      return;
    }
  } else {
    MIDPOINT_FILL_BUFFER();
    return;
  }
  
  AdvanceSamplePointer();
}


void DMA0_Channel4_IRQHandler( void )
{
  FlagStatus dma_done, dma_half_done;

  dma_done        = dma_flag_get( DMA0, DMA_CH4, DMA_FLAG_FTF );
  dma_half_done   = dma_flag_get( DMA0, DMA_CH4, DMA_FLAG_HTF );


  if( dma_half_done == SET ) {
    ProcessDMACallback( FIRST );
  }
  else if( dma_done == SET ) {
    ProcessDMACallback( SECOND );
  }
}


/** Advance the sample pointer based on playback mode and advance value
  *
  * params: none.
  * retval: none.
  *
  */
void AdvanceSamplePointer( void )
{
  if( pb_mode == 16 ) {  // Advance the 16-bit sample pointer
    pb_p16_ptr += p_advance;
    if( pb_p16_ptr >= pb_end16_ptr ) {
      pb_state = PB_Idle;
      return;
    }
  }
  else if( pb_mode == 8 ) {  // Or advance the 8-bit sample pointer
    pb_p8_ptr += p_advance;
    if( pb_p8_ptr >= pb_end8_ptr ) {
      pb_state = PB_Idle;
      return;
    }
  } 
}


/* ============================================================================
 * Chunk Processing
 * ============================================================================
 */

/** Transfers a chunk of 16-bit samples to the DMA playback buffer and processes them
  *
  * It also processes for stereo mode
  *
  * @param: int16_t* chunk_p.  The start of the chunk to transfer.
  * @retval: none.
  *
  */
PB_StatusTypeDef ProcessNextWaveChunk( int16_t * chunk_p )
{
  int16_t *input, *output;
  int16_t leftsample, rightsample;

  if( chunk_p == NULL ) {   // Sanity check
    return PB_Error;
  }

  vol_input = AudioEngine_ReadVolume();

  input   = chunk_p;      // Source sample pointer
  output  = ( half_to_fill == SECOND ) ? ( pb_buffer + CHUNK_SZ ) : pb_buffer;

  // Transfer mono audio (scaled for volume) into the stereo buffer.
  // This is done both to eliminate the need for a second resistor
  // and also because the MAX983567A expects stereo audio data, but we only
  // have one speaker.
  //
  for( uint16_t i = 0; i < HALFCHUNK_SZ; i++ )
  {
    if( (uint16_t *) input >=  pb_end16_ptr ) {                                   // Check for end of sample data
      leftsample = SAMPLE16_MIDPOINT;                                             // Pad with silence if at end 
    }
    else {
      leftsample = ApplyVolumeSetting( *input, vol_input );                       // Apply volume setting
      if( filter_cfg.enable_filter_chain_16bit == 1 ) {
      leftsample = ApplyFilterChain16Bit( leftsample, CHANNEL_LEFT );             // Apply complete filter chain
      }
    }
    input++;

    if( channels == Mode_mono ) { rightsample = leftsample; }                     // Right channel is the same as left.
    else {
      if( (uint16_t *) input >=  pb_end16_ptr ) {                                 // Check for end of sample data
        rightsample = SAMPLE16_MIDPOINT;                                          // Pad with silence if at end
      }
      else { 
        rightsample = ApplyVolumeSetting( *input, vol_input );                    // Right channel
        if( filter_cfg.enable_filter_chain_16bit == 1 ) {
        rightsample = ApplyFilterChain16Bit( rightsample, CHANNEL_RIGHT );        // Apply complete filter chain
        }
      }   // End of right channel processing
      input++;
    }
    *output = leftsample;  output++;                                              // Write samples to output buffer
    *output = rightsample; output++;
    
    // Update fade counters based on samples processed
    uint32_t samples_processed = ( channels == Mode_stereo ) ? 2 : 1;
    UpdateFadeCounters( samples_processed );
  }
  return PB_Playing;;
}


/** Transfers a chunk of 8-bit samples to the DMA playback buffer
  *
  * It also processes for stereo mode
  *
  * @param: uint8_t* chunk_p.  The start of the chunk to transfer.
  * @retval: none.
  *
  */
PB_StatusTypeDef ProcessNextWaveChunk_8_bit( uint8_t * chunk_p )
{
  uint8_t *input;
  int16_t *output;
  int16_t leftsample, rightsample;

  if( chunk_p == NULL ) {   // Sanity check
    return PB_Error;
  }

  vol_input = AudioEngine_ReadVolume();

  input   = chunk_p;                                                        // Source sample pointer
  output  = ( half_to_fill == SECOND ) ? ( pb_buffer + CHUNK_SZ ) : pb_buffer;

  // Transfer mono audio (scaled for volume) into the stereo buffer.
  // This is done both to eliminate the need for a second resistor
  // and also because the MAX983567A expects stereo audio data, but we only
  // have one speaker.

  for( uint16_t i = 0; i < HALFCHUNK_SZ; i++ )
  {
    if( (uint8_t *) input >=  pb_end8_ptr ) {                               // Check for end of sample data
      leftsample = SAMPLE16_MIDPOINT;                                       // Pad with silence if at end
    }
    else {
      /* Convert unsigned 8-bit (0..255) -> signed 16-bit with dithering */
      uint8_t sample8 = *input;
      leftsample = Apply8BitDithering( sample8 );                           // Left channel with dithering
      leftsample = ApplyVolumeSetting( leftsample, vol_input );
      if( filter_cfg.enable_filter_chain_8bit == 1 ) {
        leftsample = ApplyFilterChain8Bit( leftsample, CHANNEL_LEFT );       // Apply complete filter chain
      }
    }
    input++;

    if( channels == Mode_mono ) { rightsample = leftsample; }               // Right channel is the same as left.
    else {    
      if( (uint8_t *) input >=  pb_end8_ptr ) {                             // Check for end of sample data
        rightsample = SAMPLE16_MIDPOINT;                                    // Pad with silence if at end
      }
      else {               
        /* Convert unsigned 8-bit (0..255) -> signed 16-bit with dithering */
        uint8_t sample8 = *input;
        rightsample = Apply8BitDithering( sample8 );                        // Right channel with dithering
        rightsample = ApplyVolumeSetting( rightsample, vol_input );
        if( filter_cfg.enable_filter_chain_8bit == 1 ) {
          rightsample = ApplyFilterChain8Bit( rightsample, CHANNEL_RIGHT );   // Apply complete filter chain
        }
      }
      input++;
    }
    *output = leftsample;  output++;                                        // Transfer samples to output buffer
    *output = rightsample; output++;
    
    // Update fade counters based on samples processed
    uint32_t samples_processed = ( channels == Mode_stereo ) ? 2 : 1;
    UpdateFadeCounters( samples_processed );
  }
  return PB_Playing;
}


/* ============================================================================
 * Playback Control Functions
 * ============================================================================
 */

