JennyDigital/GD32WavePlayer/Libraries/audio_engine.c
  /* Cancel fade-in and initiate pause fadeout from current volume */
  fadein_samples_remaining  = 0;
  fadeout_samples_remaining = fadeout_start_level;
  pb_state                  = PB_Pausing;
  
  return PB_Pausing;
}


/**
  * @brief Resume playback from pause with a smooth fade-in
  * 
  * Resumes playback from where it was paused and fades in over FADEIN_SAMPLES.
  * The audio will smoothly ramp up from silence to full volume.
  * 
  * @retval PB_StatusTypeDef - PLAYING if successfully resumed, error state otherwise
  */
PB_StatusTypeDef ResumePlayback( void )
{
  if( pb_state != PB_Paused ) {
    return pb_state;  // Can only resume from paused state
  }
  
  /* Restore playback position from where it was paused */
  if( paused_sample_ptr != NULL ) {
    if( pb_mode == 16 ) {
      pb_p16_ptr  = (uint16_t *)paused_sample_ptr;
    } else {
      pb_p8_ptr   = (uint8_t *)paused_sample_ptr;
    }
  }
  

  /* Resume playback from where it was paused */
  pb_state = PB_Playing;
  
  /* Reset fade-out counter and initiate smooth fade-in */
  fadeout_samples_remaining = 0;
  fadein_samples_remaining  = pause_fadein_samples;
  
  return PB_Playing;
}


/**
  * @brief Request asynchronous stop with normal end-of-play fade-out
  *
  * Sets a stop request flag that causes playback to fade out using the standard
  * end-of-play fade and then stop. Returns immediately without blocking.
  * The DMA callback handles the actual stop when fade completes.
  *
  * Use GetPlaybackState() to poll for completion: returns PB_Idle when done.
  *
  * @retval PB_StatusTypeDef - Current playback state, or PB_Idle if already idle
  */
PB_StatusTypeDef StopPlayback( void )
{
  if( pb_state == PB_Idle ) {
    return PB_Idle;
  }

  /* Request asynchronous stop (DMA callback will handle it on next interrupt) */
  stop_requested = 1;
  
  return pb_state;
}


/** Apply non-linear volume response curve for perceptually-uniform control
  * 
  * @param: linear_volume - Linear volume value (0-65535)
  * @retval: uint16_t - Non-linearly scaled volume (0-65535)
  */
static inline uint16_t ApplyVolumeResponseCurve( uint16_t linear_volume )
{
  if( volume_response_nonlinear ) {
    /* Normalize to 0.0-1.0 range */
    float normalized = (float)linear_volume / 65535.0f;
    /* Apply inverse power law (gamma > 1 creates logarithmic response) */
    float curved = powf( normalized, 1.0f / volume_response_gamma );
    /* Scale back to 0-65535 range */
    return (uint16_t)( curved * 65535.0f + 0.5f );
  } else {
    /* Linear response - no scaling */
    return linear_volume;
  }
}

/** Apply volume setting to sample
  * 
  * @param: sample - Signed 16-bit audio sample
  * @param: volume_setting - Volume division factor (1 to 65535) where 65535 is full volume and 1 is minimum audible volume
  * @retval: int16_t - Volume-adjusted signed 16-bit audio sample
  */
static inline int16_t ApplyVolumeSetting( int16_t sample, uint16_t volume_setting )
{
  /* Apply non-linear volume response curve if enabled */
  uint16_t adjusted_volume = ApplyVolumeResponseCurve( volume_setting );
  
  int32_t sample32 = (int32_t) sample;
  int32_t volume32 = (int32_t) adjusted_volume;

  /* Apply 16-bit volume (0-65535) with proper scaling to 0.0-1.0 range
     Preserve signed sample polarity by keeping all math in signed space. */
  return  (int16_t)( ( sample32 * volume32 ) / 65535 );
}


/** Hard shutdown
  *
  * Immediately halts playback and resets all state. Use in critical failure scenarios
  * where you need to stop sound output immediately without waiting for fade-out.
  * Use with caution as it will cut off sound abruptly.
  * @param: none
  * @retval: none
   */
void ShutDownAudio( void )
{
  // Hard stop: immediately halt DMA and reset playback state
  StopDmaAndResetPlaybackState( 1U );
  MIDPOINT_FILL_BUFFER();
  pb_state = PB_Idle;

  if( dac_power_control == true ) {
    AudioEngine_DACSwitch( DAC_OFF );
  }
}


/* Return the selected alpha value
*
* @param: LPF_Level lpf_level - Desired low-pass filter level
* @retval: uint16_t - Corresponding alpha coefficient for 8-bit LPF
*/
static inline uint16_t GetLpf8BitAlpha( LPF_Level lpf_level )
{
    switch (lpf_level) {
        case LPF_Custom:
      return filter_cfg.lpf_8bit_custom_alpha;
            
        case LPF_VerySoft:
            return LPF_VERY_SOFT;

        case LPF_Soft:
            return LPF_SOFT;

        case LPF_Firm:
            return LPF_FIRM;
            
        case LPF_Aggressive:
            return LPF_AGGRESSIVE;

        case LPF_Medium:
        default:
            return LPF_MEDIUM;
    }
}


/** Enable or disable non-linear volume response
  * 
  * @brief Human hearing perceives loudness logarithmically. Enabling non-linear
  *        response applies a power curve to create more intuitive volume control.
  * 
  * @param: enable - 1 to enable non-linear response, 0 for linear
  * @retval: none
  */
void SetVolumeResponseNonlinear( uint8_t enable )
{
  volume_response_nonlinear = enable ? 1 : 0;
}


/** Get current volume response mode
  * 
  * @retval: uint8_t - 1 if non-linear, 0 if linear
  */
uint8_t GetVolumeResponseNonlinear( void )
{
  return volume_response_nonlinear;
}


/** Set volume response gamma exponent
  * 
  * @brief Controls the aggressiveness of the non-linear volume curve.
  *        Typical values: 1.0 = linear, 2.0 = quadratic (recommended for human perception)
  * 
  * @param: gamma - Gamma exponent value (clamped to 1.0-4.0 range)
  * @retval: none
  */
void SetVolumeResponseGamma( float gamma )
{
  if( gamma < 1.0f ) gamma = 1.0f;
  if( gamma > 4.0f ) gamma = 4.0f;
  volume_response_gamma = gamma;
}


/** Get current volume response gamma exponent
  * 
  * @retval: float - Current gamma value
  */
float GetVolumeResponseGamma( void )
{
  return volume_response_gamma;
}


/*!
    \brief      configure the DMA peripheral
    \param[in]  none
    \param[out] none
    \retval     none
*/
void dma_config()
{
    dma_parameter_struct dma_init_struct;
    
    /* SPI transmit dma config: DMA0,DMA_CH4  */
    dma_deinit(DMA0, DMA_CH4);
    dma_init_struct.periph_addr  = (uint32_t) &SPI_DATA( PROJECT_SPI );
    dma_init_struct.memory_addr  = (uint32_t) pb_buffer;
    dma_init_struct.direction    = DMA_MEMORY_TO_PERIPHERAL;
    dma_init_struct.memory_width = DMA_MEMORY_WIDTH_16BIT;             // This needs looking at!
    dma_init_struct.periph_width = DMA_PERIPHERAL_WIDTH_16BIT;
    dma_init_struct.priority     = DMA_PRIORITY_HIGH;
    dma_init_struct.number       = PB_BUFF_SZ;
    dma_init_struct.periph_inc   = DMA_PERIPH_INCREASE_DISABLE;
    dma_init_struct.memory_inc   = DMA_MEMORY_INCREASE_ENABLE;

    dma_init(DMA0, DMA_CH4, &dma_init_struct);

    /* configure DMA mode */
    dma_circulation_enable(DMA0, DMA_CH4);
    dma_memory_to_memory_disable(DMA0, DMA_CH4);
   

    dma_interrupt_enable(DMA0, DMA_CH4, DMA_INT_FTF | DMA_INT_HTF ); 

    dma_channel_enable(DMA0, DMA_CH4);
}
